[
  {
    "title": "Why Use a Dictionary in the Age of Internet Search?",
    "content": "I can’t remember how old I was when I first learned the words denotation (the definition of a word) and connotation (the suggestion of a word). But I do remember feeling a little betrayed by the idea that there was a whole layer of language that couldn’t quite be conveyed through a dictionary. Like most young people, I enjoyed learning but thought of it as something I would eventually be done with. At some age, I assumed, I would need to know everything. Understanding the nuances of language seemed like an obstacle to that goal.\n\nIt wasn’t until after I graduated from college, and subsequently realized that there’s no such thing as all-encompassing knowledge, that I was able to read for pleasure. A sense of curiosity, rather than desperate completism, steered me. I started to see dictionaries, inexact as they are, as field guides to the life of language. Looking up words encountered in the wild felt less like a failing than like an admission that there are lots of things I don’t know and an opportunity to discover just how many.\n\nI prize my 1954 copy of Webster’s New International Dictionary, Second Edition, which I picked up on the street near my apartment in Brooklyn a few years ago. Its 3,000 pages (India paper, with a marbled fore edge) are punctuated by a thumb index. I keep it open, solitary on a tabletop, the way dictionaries are usually found in libraries. I often consult it during evening games of Scrabble or midday magazine-reading. I mostly read novels at night, in bed, so when I come across unfamiliar words, I dog-ear the bottom of the page, then look words up in spurts. When I start encountering these words, newly resplendent to my pattern-seeking mind, in articles, podcasts, other books and even the occasional conversation, the linguistic universe seems to shrink to the size of a small town. Dictionaries heighten my senses, almost like certain mind-altering substances: They direct my attention outward, into a conversation with language. They make me wonder what other things I’m blind to because I haven’t taught myself to notice them yet. Recently spotted specimens include orrery, “a mechanical model, usually clockwork, devised to represent the motions of the earth and moon (and sometimes also the planets) around the sun.” The Oxford English Dictionary also tells me that the word comes from the fourth Earl of Orrery, for whom a copy of the first machine was made, around 1700. Useful? Obviously not. Satisfying? Deeply.\n\nWith dictionaries, unknown words become solvable mysteries. Why leave them up to guesswork?\nWikipedia and Google answer questions with more questions, opening up pages of information you never asked for. But a dictionary builds on common knowledge, using simple words to explain more complex ones. Using one feels like prying open an oyster rather than falling down a rabbit hole. Unknown words become solvable mysteries. Why leave them up to guesswork? Why not consult a dictionary and feel the instant gratification of pairing context with a definition? Dictionaries reward you for paying attention, both to the things you consume and to your own curiosity. They are a portal into the kind of irrational, childish urge to just know things that I had before learning became a duty instead of a game. I’m most amused by words that absolutely do not mean what I thought they meant. Like cygnet. Which has nothing to do with rings or stationery. (It’s a young swan.)\n\nThere are, of course, many different kinds of dictionaries. The way they’ve proliferated over time is a reminder of just how futile it is to approach language as something that can be fully understood and contained. Samuel Johnson’s Dictionary of the English Language, published in 1755, defined a paltry 40,000 words. The original O.E.D., proposed by the Philological Society of London in 1857 and completed more than 70 years later, contained over 400,000 entries. The Merriam-​Webster universe is a direct descendant of Noah Webster’s American Dictionary of the English Language, published in 1828. Compiled by Webster alone over the course of more than 20 years, it contained 70,000 words, nearly a fifth of which had never been defined before. Webster, who corresponded with founding fathers like Benjamin Franklin and John Adams, saw lexicography as an act of patriotism. He believed that establishing American standards of spelling and definition was necessary to solidify the young nation’s cultural identity as separate from that of England.\n\nPerhaps because of Webster’s enthusiasm for rules, dictionaries have long had an unfair reputation as arbiters of language, as tools used to limit rather expand your range of expression. But dictionaries don’t create language — people do. Take dilettante: The superficial connotation of the word is a modern invention. Noah Webster’s aforementioned American Dictionary defines it as “one who delights in promoting science or the fine arts.” The O.E.D. cites its connection to the Latin verb delectare, meaning “to delight or please.” To be a dilettante once meant that love and curiosity drove your interest in a given discipline. For me, dictionaries are a portal into that kind of uncalculated knowledge-seeking. They remind me that, when it comes to learning, indulging your curiosity is just as important as paying attention. After all, isn’t curiosity really just another form of attention? Following your curiosity instead of swatting it away is one of the best ways I know to feel connected to more than what’s right in front of you.",
    "image": "images/image1.jpg"
  },
  {
    "title": "How to improve your vocabulary",
    "content": "Here’s a joke that was doing the rounds on the Internet sometime back:\n\nTwo trucks loaded with thousands of copies of Roget’s Thesaurus collided as they left a New York publishing house last Thursday, according to the Associated Press.\n\nWitnesses were aghast, amazed, astonished, astounded, bemused, benumbed, bewildered, confounded, confused, dazed, dazzled, disconcerted, disoriented, dumbstruck, electrified, flabbergasted, horrified, immobilised, incredulous, nonplussed, overwhelmed, paralysed, perplexed, scared, shocked, startled, stunned, stupefied, surprised, taken aback, traumatised, upset….\n\nWhile its humour is subtle and the piece may not classify as one guaranteed to have you split your sides, it is quite an appropriate opening for this article on Vocabulary building since it takes you through the ‘vocab’ areas that are usually seen in competitive exams – ‘synonyms,’ ‘closest in meaning,’ and ‘appropriate substitute in the context’.\n\nFor those who may ask why language teaching places such stress on this area – good vocabulary helps, not only in improved performance in the VA sections of exams, but in greater enjoyment of the language and in effective communication as well. As the writer Johnson O’Connor puts it – “[Words] are the instruments by means of which men and women grasp the thoughts of others and with which they do much of their own thinking. They are the tools of thought.”\n\nBuilding a better vocabulary can, therefore, be a pleasurable and profitable investment of both your time and effort. At least 15 minutes a day of concentrated study on a regular basis can bring about a rapid improvement in your vocabulary skills. This will, in turn, increase the effectiveness of your spoken and written communication. You will also understand others’ ideas better. Overall, you would gain – at college, at work, and socially.\n\nMany of the words you already know were probably picked up as you came across them while reading, in conversation, perhaps even while watching television. You may already know thousands, and you may continue to learn more whether you work at it or not. Consider this, though – if you learned only one new word a day for the next three years, you would have about a thousand new words in your vocabulary, whereas, if you learn ten new words a day, in one year you would have added over three thousand words to what you already know, and you would also have gained a lasting habit of learning and self-improvement.\n\nThere are no shortcuts to vocabulary improvement. However, as you learn new words, it will be easier to connect a new word with words you already know, and thus remember its meaning. As such, your learning speed will increase even as your vocabulary grows.\n\nLet’s look at the most effective steps you can take.\n\nRead, and be aware of words. Folks with low vocabulary levels don’t enjoy reading. It’s probably more of a task than a pleasure because they don’t understand many of the words. If this applies to you, try reading easier matter. Newspapers are usually easier than magazines, and a magazine like Reader’s Digest is usually easier to read than, say, The Economist. It’s important to find things that you would enjoy reading, and to read as often and as much as possible, with the idea of learning new words always in mind.\n\nReading alone may not be enough to help you learn new words. When you read a novel, for instance, you must curb the desire to get on with the story and skip over unfamiliar or perhaps vaguely known words. While the totally unknown words stand out (each one like a sore thumb), you have to be especially aware of words that seem familiar to you but whose precise meanings you may not know. Take a closer look at such words. First, try to guess at a word’s meaning from its context – that is, the sense of the passage in which it appears; second, if you have a dictionary on hand, look up the word’s meaning immediately to confirm or correct your understanding. While this may slow down your reading speed initially, the improved understanding of each new word will eventually make reading easier and faster. (You could follow these steps even with words that you come across when you’re listening to the radio, talking to friends, or watching television.)\n\nRead whatever interests you. If magazines or illustrated books are your choice, read them, don’t just look at the photographs. Reading and awareness of words will help you find most of the words you should be learning. It is also the best way to check on words you have already learned.\n\nUse a Dictionary. The dictionary should be one of the most often used books in your home. Keep it where you can find it readily and use it often. If you do your reading and homework in the dining room or drawing room and the dictionary is on a shelf in the bedroom, you’re less likely to use it.\n\nThe home dictionary should be large enough to contain much more than just spellings! It should contain extensive definitions, word origins, notes on usage, and examples.\n\nGet into the habit of reading the entire entry for the word you look up. Remember, words can have more than one meaning, and the meaning you need for the word you are looking up may not be the first one given in your dictionary. Even if it is, the other meanings of the word will help you understand the different ways the word is used.\n\nAlso, the word’s “history”, usually given at the end of the entry, can often give you a fascinating picture of the way the word has developed its current meaning. This will add to the pleasure of learning the word as well as help you remember it.\n\nIn addition:\n\n(a) You could also start referring to a Thesaurus, which carries groups of words within overall meanings.\n\n(b) When you come across a word that puzzles you, ask what it means, or write down the word and look it up later, before the context of the word evaporates.\n\nRefer to vocabulary-building aids (books, etc.). These can effectively supplement the efforts you make through the first two steps discussed above. The advantages of such materials are that (i) they present you with words generally considered important to know, thus saving you time, (ii) they use the words in several sentences, so that you can see the words in different contexts, and (iii) they usually have exercises that test what you have learned.\n\nUse the Roots-Prefixes-Suffixes method. Many books approach vocabulary building by teaching you word ‘parts’ – roots, prefixes, and suffixes – and showing you how these parts can go together to form different words. You will find this approach useful, because it helps you understand how several words are formed (at least half of the words in the English language are derived from Greek and Latin roots), and this can often be of help in figuring out a word’s meaning from its context.\n\nLet’s consider the examples of a few familiar words: Let’s start with ‘philosophy’. Simply put, ‘phil’ is the Greek root for ‘love’, while ‘sopho’ is the Greek root for ‘knowledge’. Thus we have ‘love of knowledge’. When we come across other words with the same roots, we can make a reasonably good assessment of what they could mean.\n\nWe could follow the ‘phil’ connection to ‘philanthropy’. Since ‘anthrop’ is the root for ‘man’ or ‘humans’, we understand that the word means ‘love of man’ or ‘humaneness’. Taking this further, we could consider ‘anthropology’. Since any ‘ology’ is the set of truths obtained through study, we understand that the word means the study of mankind. And so on…\n\nTest yourself with games and puzzles. Try your hand at Boggle and Scrabble, games which are good fun and help you learn and use new words. In Scrabble, the excitement of using all your (seven) letters to complete an eight-letter word that covers two triple word score squares and includes high-score letters is comparable to that of finding a small fortune in the pocket of your oldest, long-forgotten jeans! Try the crosswords in the newspapers, as well. There are all kinds – easy to tough.\n\nUse the Internet. There are thousands of sites on the Web that help the ‘vocab’ enthusiast, including many free sites that mail you a word a day, a vocab tip a day, and so on – apart from those that have tests, puzzles, and word games.\n\nPerhaps the most important factor in successful vocabulary building, however, is self-motivation. A larger vocabulary will help you in academics and at work. This is absolutely true. Believe this, stay keen, and look at adding to your word bank constantly. Your time could not be better spent.\n\nDo you Know\n\nResign has opposite meanings but is pronounced differently in each case (“to quit” and “to sign again”).\n\nThe term “dog days” has nothing to do with dogs. It dates back to Roman times, when it was believed that Sirius, the Dog Star, added its heat to that of the sun from July 3 to August 11, creating exceptionally high temperatures. The Romans called the period dies caniculares, or “days of the dog”.\n\nPost navigation",
    "image": "images/image2.jpg"
  },
  {
    "title": "English language",
    "content": "English language, West Germanic language of the Indo-European language family that is closely related to the Frisian, German, and Dutch (in Belgium called Flemish) languages. English originated in England and is the dominant language of the United States, the United Kingdom, Canada, Australia, Ireland, New Zealand, and various island nations in the Caribbean Sea and the Pacific Ocean. It is also an official language of India, the Philippines, Singapore, and many countries in sub-Saharan Africa, including South Africa. English is the first choice of foreign language in most other countries of the world, and it is that status that has given it the position of a global lingua franca. It is estimated that about a third of the world’s population, some two billion persons, now use English.\n\n(Read H.L. Mencken’s 1926 Britannica essay on American English.)\n\nOrigins and basic characteristics\nIndo-European languages in contemporary Eurasia\nIndo-European languages in contemporary Eurasia\nApproximate locations of Indo-European languages in contemporary Eurasia.\n\nEnglish belongs to the Indo-European family of languages and is therefore related to most other languages spoken in Europe and western Asia from Iceland to India. The parent tongue, called Proto-Indo-European, was spoken about 5,000 years ago by nomads believed to have roamed the southeast European plains. Germanic, one of the language groups descended from this ancestral speech, is usually divided by scholars into three regional groups: East (Burgundian, Vandal, and Gothic, all extinct), North (Icelandic, Faroese, Norwegian, Swedish, and Danish), and West (German, Dutch [and Flemish], Frisian, and English). Though closely related to English, German remains far more conservative than English in its retention of a fairly elaborate system of inflections. Frisian, spoken by the inhabitants of the Dutch province of Friesland and the islands off the west coast of Schleswig, is the language most nearly related to Modern English. Icelandic, which has changed little over the last thousand years, is the living language most nearly resembling Old English in grammatical structure.\n\nModern English is analytic (i.e., relatively uninflected), whereas Proto-Indo-European, the ancestral tongue of most of the modern European languages (e.g., German, French, Russian, Greek), was synthetic, or inflected. During the course of thousands of years, English words have been slowly simplified from the inflected variable forms found in Sanskrit, Greek, Latin, Russian, and German, toward invariable forms, as in Chinese and Vietnamese. The German and Chinese words for the noun man are exemplary. German has five forms: Mann, Mannes, Manne, Männer, Männern. Chinese has one form: ren. English stands in between, with four forms: man, man’s, men, men’s. In English, only nouns, pronouns (as in he, him, his), adjectives (as in big, bigger, biggest), and verbs are inflected. English is the only European language to employ uninflected adjectives; e.g., the tall man, the tall woman, compared to Spanish el hombre alto and la mujer alta. As for verbs, if the Modern English word ride is compared with the corresponding words in Old English and Modern German, it will be found that English now has only 5 forms (ride, rides, rode, riding, ridden), whereas Old English ridan had 13, and Modern German reiten has 16.\n\nIn addition to the simplicity of inflections, English has two other basic characteristics: flexibility of function and openness of vocabulary.\nFlexibility of function has grown over the last five centuries as a consequence of the loss of inflections. Words formerly distinguished as nouns or verbs by differences in their forms are now often used as both nouns and verbs. One can speak, for example, of planning a table or tabling a plan, booking a place or placing a book, lifting a thumb or thumbing a lift. In the other Indo-European languages, apart from rare exceptions in Scandinavian languages, nouns and verbs are never identical because of the necessity of separate noun and verb endings. In English, forms for traditional pronouns, adjectives, and adverbs can also function as nouns; adjectives and adverbs as verbs; and nouns, pronouns, and adverbs as adjectives. One speaks in English of the Frankfurt Book Fair, but in German one must add the suffix -er to the place-name and put attributive and noun together as a compound, Frankfurter Buchmesse. In French one has no choice but to construct a phrase involving the use of two prepositions: Foire du Livre de Francfort. In English it is now possible to employ a plural noun as adjunct (modifier), as in wages board and sports editor; or even a conjunctional group, as in prices and incomes policy and parks and gardens committee. Any word class may alter its function in this way: the ins and outs (prepositions becoming nouns), no buts (conjunction becoming noun).\n\nGet a Britannica Premium subscription and gain access to exclusive content.\nSubscribe Now\n\nOpenness of vocabulary implies both free admission of words from other languages and the ready creation of compounds and derivatives. English adopts (without change) or adapts (with slight change) any word really needed to name some new object or to denote some new process. Words from more than 350 languages have entered English in this way. Like French, Spanish, and Russian, English frequently forms scientific terms from Classical Greek word elements. Although a Germanic language in its sounds and grammar, the bulk of English vocabulary is in fact Romance or Classical in origin.\n\nEnglish possesses a system of orthography that does not always accurately reflect the pronunciation of words; see below Orthography.",
    "image": "images/image3.jpg"
  }
]
